//=============================================================================
//	@file	CameraComponent.h
//	@brief	カメラの機能を持つコンポーネントの基底クラス
//	@autor	居本 和哉
//	@date	2020/02/29
//=============================================================================

//-----------------------------------------------------------------------------
//	@brief	プリプロセッサ
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
//	@brief	インクルード
//-----------------------------------------------------------------------------
#include "Component.h"
#include "Math.h"

//-----------------------------------------------------------------------------
//	@brief	前方宣言
//-----------------------------------------------------------------------------
class GameObject;

//-----------------------------------------------------------------------------
//	@brief	CameraComponentクラス
//-----------------------------------------------------------------------------
class CameraComponent : public Component
{
public:
//===================== publicのメンバ関数 ======================//

	/**
	@brief	コンストラクタ
	@param	アタッチするゲームオブジェクトのポインタ
	@param	コンポーネントの更新順番（数値が小さいほど早く更新される）
	*/
	CameraComponent(GameObject* _owner,int _updateOrder = 200);

	/**
	@brief	フレーム毎の処理
	@param	最後のフレームを完了するのに要した時間
	*/
	void Update(float _deltaTime) override;

protected:
//===================== protectedのメンバ関数 ======================//

	/**
	@brief	ビュー行列を設定する
	@param	設定するビュー行列
	*/
	void SetViewMatrix(const Matrix4& _view);
};


