//=============================================================================
//	@file	main.cpp
//	@brief	メインcppファイル
//	@autor	居本 和哉
//	@date	2019/10/3
//=============================================================================

//-----------------------------------------------------------------------------
//	@brief	インクルード
//-----------------------------------------------------------------------------
#include "SDL.h"
#include "Game.h"

//-----------------------------------------------------------------------------
//	@brief	main関数
//  @param  コマンドライン引数の数
//  @param  コマンドライン引数
//-----------------------------------------------------------------------------
int main(int argc, char** argv)
{
    //ゲームクラスの定義
	Game game;
    //ゲームクラスの初期化が成功したか
	bool success = game.Initialize();
	if (success)
	{
		game.GameLoop();
	}
    //ゲームクラスの終了処理
	game.Termination();

	return 0;
}